T1rouvaille/RA2E1_IBOX/src/menu.c
/* ================================================================== */
/*  Command handlers — Honcho PR3 IBOX protocol                         */
/* ================================================================== */

/*
 * 'B' HANDSHAKE
 * Response: 'B' (echo back)
 * After handshake, EEPROM is read for subsequent READ_EEPROM commands
 */
static void cmd_handshake(void)
{
    uint8_t rsp = COMMAND_HANDSHAKE;
    comms_send(&rsp, 1U);

    if (g_read_eeprom == 0U)
    {
        g_read_eeprom = 1U;  /* Trigger EEPROM read on next loop */
    }

    /* Stop timer — subsequent operations never timeout (same as abs_bootloader) */
    g_timer_enabled = false;
    g_timer0.p_api->stop(g_timer0.p_ctrl);
}

/*
 * 'I' IDENTIFY — Honcho PR3 format
 * Response: 'I' + 0x04 + 0x45 + ETX (4 bytes)
 */
static void cmd_identify(void)
{
    uint8_t rsp[4];
    rsp[0] = COMMAND_IDENTIFY;
    rsp[1] = 0x04U;
    rsp[2] = 0x45U;
    rsp[3] = ETX;
    comms_send(rsp, sizeof(rsp));
}

/*
 * 'D' SET_ADDRESS — Honcho PR3 format
 *
 * Honcho DL_Send_Set_Addr_Msg():
 *   1) uart_tx_bit_bang('D')         — 先回显 'D'
 *   2) addr_high = uart_rx_bit_bang() — 再收高字节
 *   3) addr_low  = uart_rx_bit_bang() — 收低字节
 *   4) uart_tx_bit_bang(ETX)         — 最后发 ETX
 */
static void cmd_set_address(void)
{
    uint8_t ah, al;

    /* 1) 先回显 'D' — 上位机等待此回显后才发地址字节 */
    {
        uint8_t echo = COMMAND_SET_ADDRESS;
        comms_send(&echo, 1U);
    }

    /* 2) 接收 2 字节地址 */
    if (recv_byte(&ah) != FSP_SUCCESS) { send_nak(); return; }
    if (recv_byte(&al) != FSP_SUCCESS) { send_nak(); return; }

    uint8_t etx = ETX;
    comms_send(&etx, 1U);

    g_addr_high = ah;
    g_addr_low  = al;
    g_target_offset = ((uint32_t)ah << 8U) | (uint32_t)al;
    g_target_addr   = g_target_offset;  // 绝对地址

/*     3) 发 ETX
    {

    }*/
}

/*
 * 'N' READ_FLASH — Honcho PR3 format
 *
 * Honcho IBOX(): 不读取任何字节, 根据已存地址响应:
 *   addr=0xFFFF → DL_Send_Read_FLASH_Msg()       // 版本信息 (88 bytes)
 *   addr=0xFFFE → DL_Calibration_Msg()           // 校准 (5 bytes)
 *   other       → uart_tx_bit_bang('N')          // 仅回显 'N'
 */
static void cmd_read_flash(void)
{
    if (g_target_offset == VERSION_REQUEST_OFFSET)
    {

        /* addr = 0xFFFF → 版本信息 */
        cmd_read_version_info();
        g_target_offset = 0U;
        g_target_addr =  0x00000000;
    }
    else if (g_target_offset == CALIBRATION_REQUEST_OFFSET)
    {
        /* addr = 0xFFFE → 校准响应 */
        cmd_calibration();
        g_target_offset = 0U;
        g_target_addr =  0x00000000;
    }
    else
    {
        /* 其他地址 → 读取 Flash 内容 (从 g_target_addr 开始, 512 字节) */
        static uint8_t rsp[PAGE_SIZE + 4];
        uint16_t i;

        /* LED 指示: 读 Flash 期间点亮 */
        LED1_ON; LED2_ON; LED3_ON;

        rsp[0] = COMMAND_READ_FLASH;
        rsp[1] = (uint8_t)(PAGE_SIZE >> 8U);
        rsp[2] = (uint8_t)(PAGE_SIZE & 0xFFU);

        ThreadsAndInterrupts(DISABLE);
        for (i = 0U; i < PAGE_SIZE; i++)
        {
            rsp[3U + i] = *(uint8_t *)(g_target_addr + i);
        }
        ThreadsAndInterrupts(RE_ENABLE);
        rsp[3U + PAGE_SIZE] = ETX;

        comms_send(rsp, sizeof(rsp));

        /* 成功: LED 保持点亮 */

        g_target_offset = 0U;
        g_target_addr =  0x00000000;
    }

    /* 切回低速波特率 (与 abs_bootloader 的 Read_Flash_Page 一致) */
    comms_set_baud(UART_BAUD_SLOW);
}

/*
 * 版本信息响应 — Honcho DL_Send_Read_FLASH_Msg() 格式
 *
 * 完整响应 (90 bytes):
 *   'N' + 0x00 + 0x56 (86 = payload size)
 *   + g_module_id[8]             (offset  3-10)
 *   + g_module_id_second[8]      (offset 11-18)
 *   + ' '                       (offset 19)
 *   + g_tool_part_number[8]     (offset 20-27)
 *   + g_personalization[40]     (offset 28-67)
 *   + SW_VERSION_MAJOR          (offset 68)
 *   + SW_VERSION_MINOR          (offset 69)
 *   + SW_VERSION_MAJOR (重复)   (offset 70)
 *   + SW_VERSION_MINOR (重复)   (offset 71)
 *   + UCID[0..3]                (offset 72-75)  ← DEVICEID[0]
 *   + UCID[4..7]                (offset 76-79)  ← DEVICEID[1]
 *   + UCID[8..11]               (offset 80-83)  ← DEVICEADDR[0]
 *   + UCID[12..15]              (offset 84-87)  ← DEVICEADDR[1]
 *   + MODULE_REVISION           (offset 88)
 *   + ETX                       (offset 89)
 */
static void cmd_read_version_info(void)
{
    uint8_t  rsp[90];
    uint16_t i;
    uint16_t offset = 0U;

    /* Header: 'N' + len (86 bytes payload) */
    rsp[offset++] = COMMAND_READ_FLASH;
    rsp[offset++] = 0x00U;
    rsp[offset++] = VERSION_PAYLOAD_SIZE;   /* 86 */

    /* Module ID — 8 bytes */
    for (i = 0U; i < BYTES_MODULE_ID; i++)
    {
        rsp[offset++] = g_module_id[i];
    }

    /* Code Module ID — 8 bytes */
    for (i = 0U; i < BYTES_MODULE_ID; i++)
    {
        rsp[offset++] = g_module_id_second[i];
    }

    /* Space separator */
    rsp[offset++] = ' ';

    /* Part Number — 8 bytes */
    for (i = 0U; i < BYTES_PART_NUMBER; i++)
    {
        rsp[offset++] = (uint8_t)g_tool_part_number[i];
    }

    /* Personalization — 40 bytes (covers offset 26-65) */
    for (i = 0U; i < BYTES_PERSONALIZATION; i++)
    {
        rsp[offset++] = (uint8_t)g_personalization[i];
    }

    /* SW Version */
    rsp[offset++] = SW_VERSION_MAJOR;
    rsp[offset++] = SW_VERSION_MINOR;
    rsp[offset++] = SW_VERSION_MAJOR;   /* 重复 */
    rsp[offset++] = SW_VERSION_MINOR;   /* 重复 */

    /* Serialization — RA2E1 UCID 16 bytes (Honcho PR3 格式:
     *   DEVICEID[0:4] + DEVICEID[1:4] + DEVICEADDR[0:4] + DEVICEADDR[1:4]) */
    for (i = 0U; i < 4U; i++)  { rsp[offset++] = *(uint8_t *)(UCID_ADDRESS + i); }        /* UCID[0..3]  */
    for (i = 0U; i < 4U; i++)  { rsp[offset++] = *(uint8_t *)(UCID_ADDRESS + 4U + i); }    /* UCID[4..7]  */
    for (i = 0U; i < 4U; i++)  { rsp[offset++] = *(uint8_t *)(UCID_ADDRESS + 8U + i); }    /* UCID[8..11] */
    for (i = 0U; i < 4U; i++)  { rsp[offset++] = *(uint8_t *)(UCID_ADDRESS + 12U + i); }   /* UCID[12..15]*/

    /* MODULE_REVISION */
    rsp[offset++] = MODULE_REVISION;

    /* ETX */
    rsp[offset++] = ETX;

