T1rouvaille/RA2E1_IBOX/src/menu.c
    /* Switch to fast baud rate (28800) */
    fsp_err_t err = comms_set_baud(UART_BAUD_FAST);
    if (err != FSP_SUCCESS)
    {
        send_nak();
    }
}


/* ================================================================== */
/*  Boot attempt                                                        */
/* ================================================================== */
static void try_boot(void)
{
    struct boot_rsp rsp;
    /* Jump to APP unconditionally (same as abs_bootloader) */
    do_boot(&rsp);
}

/* ================================================================== */
/*  EEPROM Bank Management                                             */
/* ================================================================== */

static void FEE_Read(void)
{
    uint8_t bank_state;
    Get_Bank_Final_State(&bank_state);

    switch (bank_state)
    {
        case 0x00U: /* B0 empty,   B1 empty   */
        case 0x20U: /* B0 invalid, B1 empty   */
        case 0x02U: /* B0 empty,   B1 invalid */
        case 0x22U: /* B0 invalid, B1 invalid */
            g_FEE_Buffer[0] = 0xFFU;
            break;

        case 0x10U: /* B0 valid,   B1 empty   */
        case 0x34U: /* B0 new,     B1 old     */
        case 0x12U: /* B0 valid,   B1 invalid */
            /* Read from Bank0 */
            for (uint16_t i = 0U; i < FEE_SIZE; i++)
            {
                g_FEE_Buffer[i] = *(uint8_t *)(FMC_BANK0_START_ADRESS + i);
            }
            break;

        case 0x01U: /* B0 empty,   B1 valid   */
        case 0x21U: /* B0 invalid, B1 valid   */
        case 0x43U: /* B0 old,     B1 new     */
            /* Read from Bank1 */
            for (uint16_t i = 0U; i < FEE_SIZE; i++)
            {
                g_FEE_Buffer[i] = *(uint8_t *)(FMC_BANK1_START_ADRESS + i);
            }
            break;

        default:
            break;
    }
}

static void FEE_Write(void)
{
    uint8_t bank_state;
    Get_Bank_Final_State(&bank_state);
    fsp_err_t err;

    switch (bank_state)
    {
        case 0x00U: /* B0 empty,   B1 empty   */
        case 0x20U: /* B0 invalid, B1 empty   */
        case 0x02U: /* B0 empty,   B1 invalid */
        case 0x01U: /* B0 empty,   B1 valid   */
        case 0x43U: /* B0 old,     B1 new     */
        case 0x21U: /* B0 invalid, B1 valid   */
            /* Write to Bank0 */
            ThreadsAndInterrupts(DISABLE);
            err = g_flash0.p_api->write(g_flash0.p_ctrl, (uint32_t)g_FEE_Buffer,
                                        FMC_BANK0_START_ADRESS, FEE_SIZE);
            ThreadsAndInterrupts(RE_ENABLE);
            break;

        case 0x34U: /* B0 new,     B1 old     */
        case 0x10U: /* B0 valid,   B1 empty   */
        case 0x12U: /* B0 valid,   B1 invalid */
            /* Write to Bank1 */
            ThreadsAndInterrupts(DISABLE);
            err = g_flash0.p_api->write(g_flash0.p_ctrl, (uint32_t)g_FEE_Buffer,
                                        FMC_BANK1_START_ADRESS, FEE_SIZE);
            ThreadsAndInterrupts(RE_ENABLE);
            break;

        case 0x22U: /* B0 invalid, B1 invalid */
            /* Write to both banks */
            ThreadsAndInterrupts(DISABLE);
            err = g_flash0.p_api->write(g_flash0.p_ctrl, (uint32_t)g_FEE_Buffer,
                                        FMC_BANK0_START_ADRESS, FEE_SIZE);
            if (err == FSP_SUCCESS)
            {
                err = g_flash0.p_api->write(g_flash0.p_ctrl, (uint32_t)g_FEE_Buffer,
                                            FMC_BANK1_START_ADRESS, FEE_SIZE);
            }
            ThreadsAndInterrupts(RE_ENABLE);
            break;

        default:
            break;
    }
}

static void Get_Bank_Final_State(uint8_t* state)
{
    uint32_t bank0_start_count = *(uint32_t *)FMC_BANK0_START_ADRESS & 0xFFFFFU;
    uint32_t bank1_start_count = *(uint32_t *)FMC_BANK1_START_ADRESS & 0xFFFFFU;
    uint32_t bank0_end_count   = *(uint32_t *)FMC_BANK0_END_ADRESS >> 8U;
    uint32_t bank1_end_count   = *(uint32_t *)FMC_BANK1_END_ADRESS >> 8U;

    uint8_t bank0_state = BANK_EMPTY;
    uint8_t bank1_state = BANK_EMPTY;

    /* Determine Bank0 state */
    if (bank0_start_count == bank0_end_count)
    {
        bank0_state = (bank0_start_count == 0xFFFFFFU) ? BANK_EMPTY : BANK_VALID;
    }
    else
    {
        bank0_state = BANK_INVALID;
    }

    /* Determine Bank1 state */
    if (bank1_start_count == bank1_end_count)
    {
        bank1_state = (bank1_start_count == 0xFFFFFFU) ? BANK_EMPTY : BANK_VALID;
    }
    else
    {
        bank1_state = BANK_INVALID;
    }

    /* Determine which bank is newer if both are valid */
    if ((bank0_state == BANK_VALID) && (bank1_state == BANK_VALID))
    {
        if (bank0_start_count >= bank1_start_count)
        {
            bank0_state = BANK_NEW;
            bank1_state = BANK_OLD;
        }
        else
        {
            bank1_state = BANK_NEW;
            bank0_state = BANK_OLD;
        }
    }

    *state = (uint8_t)((bank0_state << 4U) | bank1_state);
}

static void Increment_EEP_Buffer(const uint8_t bytes, const uint8_t increment)
{
    uint8_t i;
    uint32_t temp = 0U;
    const uint32_t max = ((uint32_t)(1U << (8U * bytes)) - 1U);

    for (i = 0U; i < bytes; i++)
    {
        temp += (uint32_t)g_FEE_Buffer[i] << (8U * i);
    }

    if (temp < max - increment)
    {
        temp += increment;
    }
    else
    {
        temp = max;
    }

    for (i = 0U; i < bytes; i++)
    {
        g_FEE_Buffer[i]                    = (uint8_t)(temp & 0xFFU);
        g_FEE_Buffer[FEE_SIZE - bytes + i] = (uint8_t)(temp & 0xFFU);
        temp >>= 8U;
    }
}

/* ================================================================== */
/*  Helpers                                                             */
/* ================================================================== */

static void send_nak(void)
{
    uint8_t b = NAK;
    comms_send(&b, 1U);
}

static fsp_err_t recv_byte(uint8_t *out)
{
    uint32_t len = 1U;
    if (g_timer_enabled)
    {
        return comms_read(out, &len, RX_TIMEOUT_MS);
    }
    else
    {
        return comms_read_blocking(out, &len);
    }
}

static uint16_t checksum16(const uint8_t *buf, uint16_t len)
{
    uint16_t sum = 0U;
    for (uint16_t i = 0U; i < len; i++)
    {
        sum += buf[i];
    }
    return sum;
}

static bool addr_in_app_range(uint32_t addr, uint32_t len)
{
    if (addr < APP_IMAGE_START_ADDRESS)              return false;
    if ((addr + len) > (APP_IMAGE_END_ADDRESS - 8U)) return false;
    return true;
}

static fsp_err_t erase_block_if_needed(uint32_t addr)
{
    if ((addr % FLASH_BLOCK_SIZE) != 0U)
    {
        return FSP_SUCCESS;
    }

    fsp_err_t err;
    ThreadsAndInterrupts(DISABLE);
    err = g_flash0.p_api->erase(g_flash0.p_ctrl, addr, 1U);
    ThreadsAndInterrupts(RE_ENABLE);
    return err;
}

/* ================================================================== */
/*  ThreadsAndInterrupts                                                */
/* ================================================================== */
void ThreadsAndInterrupts(enable_disable_t EnableDisable)
{
    static uint32_t control_reg_value;
    static uint32_t old_primask;

    if (DISABLE == EnableDisable)
    {
        old_primask       = __get_PRIMASK();
        control_reg_value = SysTick->CTRL;
        SysTick->CTRL     = 0;
        NVIC_DisableIRQ(SysTick_IRQn);
        NVIC_ClearPendingIRQ(SysTick_IRQn);
        __disable_irq();
    }
    else
    {
        NVIC_EnableIRQ(SysTick_IRQn);
        SysTick->CTRL = control_reg_value;
        __set_PRIMASK(old_primask);
    }
}
